Revit 2027 API
FilteredWorksetCollector.ToWorksets Method
 Returns the complete set of worksets that pass the filter(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Workset> ToWorksets()
Public Function ToWorksets As IList(Of Workset)
public:
IList<Workset^>^ ToWorksets()
member ToWorksets : unit -> IList<Workset>
Return Value
IList<Workset>
 The complete array of worksets.
Exceptions
Exception | Condition
InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter.
Remarks
 This will reset the collector to the beginning and extract all worksets that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace